CpTrueno/LSTC_Curse/Architecture_00/Inc/SYS/STM32F042_REGS_.h
/*
 * STM32F042_REGS_.h
 *
 *  Created on: Apr 25, 2021
 *      Author: Usuario
 */

#ifndef STM32F042_REGS__H_
#define STM32F042_REGS__H_

/* **************************************************************************
** M0 CORE REGISTERS
************************************************************************** */

#include "CORTEX_M0_.h"

/* **************************************************************************
** ST IP'S REGISTERS
** --------------------------------------------------------------------------
**
************************************************************************** */

/* **************************************************************************
** PERIPHERALS TO APB
************************************************************************** */

/* *** TIM2 (Base:0x.4000.0000) ****************************************** */

#define TIM2_BASE       (0x40000000)
#define TIM2_CR1        ((volatile unsigned int *)(TIM2_BASE+0x00))
#define TIM2_CR2        ((volatile unsigned int *)(TIM2_BASE+0x04))
#define TIM2_SMCR       ((volatile unsigned int *)(TIM2_BASE+0x08))
#define TIM2_DIER       ((volatile unsigned int *)(TIM2_BASE+0x0C))
#define TIM2_SR         ((volatile unsigned int *)(TIM2_BASE+0x10))
#define TIM2_EGR        ((volatile unsigned int *)(TIM2_BASE+0x14))
#define TIM2_CCMR1      ((volatile unsigned int *)(TIM2_BASE+0x18))
#define TIM2_CCMR2      ((volatile unsigned int *)(TIM2_BASE+0x1C))
#define TIM2_CCER       ((volatile unsigned int *)(TIM2_BASE+0x20))
#define TIM2_CNT        ((volatile unsigned int *)(TIM2_BASE+0x24))
#define TIM2_PSC        ((volatile unsigned int *)(TIM2_BASE+0x28))
#define TIM2_ARR        ((volatile unsigned int *)(TIM2_BASE+0x2C))
#define TIM2_CCR1       ((volatile unsigned int *)(TIM2_BASE+0x34))
#define TIM2_CCR2       ((volatile unsigned int *)(TIM2_BASE+0x38))
#define TIM2_CCR3       ((volatile unsigned int *)(TIM2_BASE+0x3C))
#define TIM2_CCR4       ((volatile unsigned int *)(TIM2_BASE+0x40))
#define TIM2_DCR        ((volatile unsigned int *)(TIM2_BASE+0x48))
#define TIM2_DMAR       ((volatile unsigned int *)(TIM2_BASE+0x4C))

/* *** TIM3 (Base:0x.4000.0400) ****************************************** */

#define TIM3_BASE       (0x40000400)
#define TIM3_CR1        ((volatile unsigned int *)(TIM3_BASE+0x00))
#define TIM3_CR2        ((volatile unsigned int *)(TIM3_BASE+0x04))
#define TIM3_SMCR       ((volatile unsigned int *)(TIM3_BASE+0x08))
#define TIM3_DIER       ((volatile unsigned int *)(TIM3_BASE+0x0C))
#define TIM3_SR         ((volatile unsigned int *)(TIM3_BASE+0x10))
#define TIM3_EGR        ((volatile unsigned int *)(TIM3_BASE+0x14))
#define TIM3_CCMR1      ((volatile unsigned int *)(TIM3_BASE+0x18))
#define TIM3_CCMR2      ((volatile unsigned int *)(TIM3_BASE+0x1C))
#define TIM3_CCER       ((volatile unsigned int *)(TIM3_BASE+0x20))
#define TIM3_CNT        ((volatile unsigned int *)(TIM3_BASE+0x24))
#define TIM3_PSC        ((volatile unsigned int *)(TIM3_BASE+0x28))
#define TIM3_ARR        ((volatile unsigned int *)(TIM3_BASE+0x2C))
#define TIM3_CCR1       ((volatile unsigned int *)(TIM3_BASE+0x34))
#define TIM3_CCR2       ((volatile unsigned int *)(TIM3_BASE+0x38))
#define TIM3_CCR3       ((volatile unsigned int *)(TIM3_BASE+0x3C))
#define TIM3_CCR4       ((volatile unsigned int *)(TIM3_BASE+0x40))
#define TIM3_DCR        ((volatile unsigned int *)(TIM3_BASE+0x48))
#define TIM3_DMAR       ((volatile unsigned int *)(TIM3_BASE+0x4C))

/* *** TIM7 (Base:0x.4000.1400) ****************************************** */

#define TIM7_BASE       (0x40001400)
#define TIM7_CR1        ((volatile unsigned int *)(TIM7_BASE+0x00))
#define TIM7_CR2        ((volatile unsigned int *)(TIM7_BASE+0x04))
#define TIM7_DIER       ((volatile unsigned int *)(TIM7_BASE+0x0C))
#define TIM7_SR         ((volatile unsigned int *)(TIM7_BASE+0x10))
#define TIM7_CNT        ((volatile unsigned int *)(TIM7_BASE+0x24))
#define TIM7_PSC        ((volatile unsigned int *)(TIM7_BASE+0x28))
#define TIM7_ARR        ((volatile unsigned int *)(TIM7_BASE+0x2C))

/* *** TIM14 (Base:0x.4000.2000) ***************************************** */

#define TIM14_BASE      (0x40002000)
#define TIM14_CR1       ((volatile unsigned int *)(TIM14_BASE+0x00))
#define TIM14_DIER      ((volatile unsigned int *)(TIM14_BASE+0x0C))
#define TIM14_SR        ((volatile unsigned int *)(TIM14_BASE+0x10))
#define TIM14_EGR       ((volatile unsigned int *)(TIM14_BASE+0x14))
#define TIM14_CCMR1     ((volatile unsigned int *)(TIM14_BASE+0x18))
#define TIM14_CCER      ((volatile unsigned int *)(TIM14_BASE+0x20))
#define TIM14_CNT       ((volatile unsigned int *)(TIM14_BASE+0x24))
#define TIM14_PSC       ((volatile unsigned int *)(TIM14_BASE+0x28))
#define TIM14_ARR       ((volatile unsigned int *)(TIM14_BASE+0x2C))
#define TIM14_CCR1      ((volatile unsigned int *)(TIM14_BASE+0x34))
#define TIM14_OR        ((volatile unsigned int *)(TIM14_BASE+0x50))

/* *** RTC (Base: 0x.4000.2800) ****************************************** */

#define RTC_BASE        (0x40002800)
#define RTC_TR          ((volatile unsigned int *)(RTC_BASE+0x00))
#define RTC_DR          ((volatile unsigned int *)(RTC_BASE+0x04))
#define RTC_CR          ((volatile unsigned int *)(RTC_BASE+0x08))
#define RTC_ISR         ((volatile unsigned int *)(RTC_BASE+0x0C))
#define RTC_PRER        ((volatile unsigned int *)(RTC_BASE+0x10))
#define RTC_WUTR        ((volatile unsigned int *)(RTC_BASE+0x14))
#define RTC_ALRMAR      ((volatile unsigned int *)(RTC_BASE+0x1C))
#define RTC_WPR         ((volatile unsigned int *)(RTC_BASE+0x24))
#define RTC_SSR         ((volatile unsigned int *)(RTC_BASE+0x28))
#define RTC_SHIFTR      ((volatile unsigned int *)(RTC_BASE+0x2C))
#define RTC_TSTR        ((volatile unsigned int *)(RTC_BASE+0x30))
#define RTC_TSDR        ((volatile unsigned int *)(RTC_BASE+0x34))
#define RTC_TSSSR       ((volatile unsigned int *)(RTC_BASE+0x38))
#define RTC_CALR        ((volatile unsigned int *)(RTC_BASE+0x3C))
#define RTC_TAFCR       ((volatile unsigned int *)(RTC_BASE+0x40))
#define RTC_ALRMASSR    ((volatile unsigned int *)(RTC_BASE+0x44))
#define RTC_BKP0R       ((volatile unsigned int *)(RTC_BASE+0x50))
#define RTC_BKP1R       ((volatile unsigned int *)(RTC_BASE+0x54))
#define RTC_BKP2R       ((volatile unsigned int *)(RTC_BASE+0x58))
#define RTC_BKP3R       ((volatile unsigned int *)(RTC_BASE+0x5C))
#define RTC_BKP4R       ((volatile unsigned int *)(RTC_BASE+0x60))

/* *** WWDG (Base:0x.4000.2C00) ****************************************** */

