CpTrueno/LSTC_Curse/Architecture_00/Inc/SYS/STM32F042_REGS_.h
#define WWDG_BASE       (0x40002C00)
#define WWDG_CR         ((volatile unsigned int *)(WWDG_BASE+0x00))
#define WWDG_CFR        ((volatile unsigned int *)(WWDG_BASE+0x04))
#define WWDG_SR         ((volatile unsigned int *)(WWDG_BASE+0x08))

/* *** IWDG (Base:0x.4000.3000) ****************************************** */

#define IWDG_BASE       (0x40003000)
#define IWDG_KR         ((volatile unsigned int *)(IWDG_BASE+0x00))
#define IWDG_PR         ((volatile unsigned int *)(IWDG_BASE+0x04))
#define IWDG_RLR        ((volatile unsigned int *)(IWDG_BASE+0x08))
#define IWDG_SR         ((volatile unsigned int *)(IWDG_BASE+0x0C))
#define IWDG_WINR       ((volatile unsigned int *)(IWDG_BASE+0x10))

/* *** SPI2 (Base: 0x4000.3800) ****************************************** */

#define SPI2_BASE       (0x40003800)
#define SPI2_CR1        ((volatile unsigned int *)(SPI2_BASE+0x00))
#define SPI2_CR2        ((volatile unsigned int *)(SPI2_BASE+0x04))
#define SPI2_SR         ((volatile unsigned int *)(SPI2_BASE+0x08))
#define SPI2_DR         ((volatile unsigned int *)(SPI2_BASE+0x0C))
#define SPI2_CRCPR      ((volatile unsigned int *)(SPI2_BASE+0x10))
#define SPI2_RXCRCR     ((volatile unsigned int *)(SPI2_BASE+0x14))
#define SPI2_TXCRCR     ((volatile unsigned int *)(SPI2_BASE+0x18))
#define SPI2_I2SCFGR    ((volatile unsigned int *)(SPI2_BASE+0x1C))
#define SPI2_I2SPR      ((volatile unsigned int *)(SPI2_BASE+0x20))

/* *** USART2 (Base: 0x.4000.4400) *************************************** */

#define USART2_BASE       (0x40004400)
#define USART2_CR1        ((volatile unsigned int *)(USART2_BASE+0x00))
#define USART2_CR2        ((volatile unsigned int *)(USART2_BASE+0x04))
#define USART2_CR3        ((volatile unsigned int *)(USART2_BASE+0x08))
#define USART2_BRR        ((volatile unsigned int *)(USART2_BASE+0x0C))
#define USART2_GTPR       ((volatile unsigned int *)(USART2_BASE+0x10))
#define USART2_RTOR       ((volatile unsigned int *)(USART2_BASE+0x14))
#define USART2_RQR        ((volatile unsigned int *)(USART2_BASE+0x18))
#define USART2_ISR        ((volatile unsigned int *)(USART2_BASE+0x1C))
#define USART2_ICR        ((volatile unsigned int *)(USART2_BASE+0x20))
#define USART2_RDR        ((volatile unsigned int *)(USART2_BASE+0x24))
#define USART2_TDR        ((volatile unsigned int *)(USART2_BASE+0x28))

/* *** I2C1 (Base: 0x.4000.5400) ***************************************** */

#define I2C1_BASE         (0x40005400)
#define I2C1_CR1          ((volatile unsigned int *)(I2C1_BASE+0x00))
#define I2C1_CR2          ((volatile unsigned int *)(I2C1_BASE+0x04))
#define I2C1_OAR1         ((volatile unsigned int *)(I2C1_BASE+0x08))
#define I2C1_OAR2         ((volatile unsigned int *)(I2C1_BASE+0x0C))
#define I2C1_TIMINGR      ((volatile unsigned int *)(I2C1_BASE+0x10))
#define I2C1_TIMEOUTR     ((volatile unsigned int *)(I2C1_BASE+0x14))
#define I2C1_ISR          ((volatile unsigned int *)(I2C1_BASE+0x18))
#define I2C1_ICR          ((volatile unsigned int *)(I2C1_BASE+0x1C))
#define I2C1_PECR         ((volatile unsigned int *)(I2C1_BASE+0x20))
#define I2C1_RXDR         ((volatile unsigned int *)(I2C1_BASE+0x24))
#define I2C1_TXDR         ((volatile unsigned int *)(I2C1_BASE+0x28))

/* *** USB (Base: 0x.4000.5C00) ****************************************** */

#define USB_BASE        (0x40005C00)
#define USB_EP0R        ((volatile unsigned int *)(USB_BASE+0x00))
#define USB_EP1R        ((volatile unsigned int *)(USB_BASE+0x04))
#define USB_EP2R        ((volatile unsigned int *)(USB_BASE+0x08))
#define USB_EP3R        ((volatile unsigned int *)(USB_BASE+0x0C))
#define USB_EP4R        ((volatile unsigned int *)(USB_BASE+0x10))
#define USB_EP5R        ((volatile unsigned int *)(USB_BASE+0x14))
#define USB_EP6R        ((volatile unsigned int *)(USB_BASE+0x18))
#define USB_EP7R        ((volatile unsigned int *)(USB_BASE+0x1C))

#define USB_CNTR        ((volatile unsigned int *)(USB_BASE+0x40))
#define USB_ISTR        ((volatile unsigned int *)(USB_BASE+0x44))
#define USB_FNR         ((volatile unsigned int *)(USB_BASE+0x48))
#define USB_DADDR       ((volatile unsigned int *)(USB_BASE+0x4C))
#define USB_BTABLE      ((volatile unsigned int *)(USB_BASE+0x50))
#define USB_LPMCSR      ((volatile unsigned int *)(USB_BASE+0x54))
#define USB_BCDR        ((volatile unsigned int *)(USB_BASE+0x58))

/* *** USB/CAN SRAM (Base: 0x.4000.6000) ********************************* */

#define USBSRAM_BASE    (0x40006000)
#define USB_ADTX0       ((volatile unsigned short *)(USBSRAM_BASE+0x00))
#define USB_ADRX0       ((volatile unsigned short *)(USBSRAM_BASE+0x04))
#define USB_ADTX1       ((volatile unsigned short *)(USBSRAM_BASE+0x08))
#define USB_ADRX1       ((volatile unsigned short *)(USBSRAM_BASE+0x0C))
#define USB_ADTX2       ((volatile unsigned short *)(USBSRAM_BASE+0x10))
#define USB_ADRX2       ((volatile unsigned short *)(USBSRAM_BASE+0x14))
#define USB_ADTX3       ((volatile unsigned short *)(USBSRAM_BASE+0x18))
#define USB_ADRX3       ((volatile unsigned short *)(USBSRAM_BASE+0x1C))
#define USB_ADTX4       ((volatile unsigned short *)(USBSRAM_BASE+0x20))
#define USB_ADRX4       ((volatile unsigned short *)(USBSRAM_BASE+0x24))
#define USB_ADTX5       ((volatile unsigned short *)(USBSRAM_BASE+0x28))
#define USB_ADRX5       ((volatile unsigned short *)(USBSRAM_BASE+0x2C))
#define USB_ADTX6       ((volatile unsigned short *)(USBSRAM_BASE+0x30))
#define USB_ADRX6       ((volatile unsigned short *)(USBSRAM_BASE+0x34))
#define USB_ADTX7       ((volatile unsigned short *)(USBSRAM_BASE+0x38))
#define USB_ADRX7       ((volatile unsigned short *)(USBSRAM_BASE+0x3C))

#define USB_SZTX0       ((volatile unsigned short *)(USBSRAM_BASE+0x02))
#define USB_SZRX0       ((volatile unsigned short *)(USBSRAM_BASE+0x06))
#define USB_SZTX1       ((volatile unsigned short *)(USBSRAM_BASE+0x0A))
#define USB_SZRX1       ((volatile unsigned short *)(USBSRAM_BASE+0x0E))
#define USB_SZTX2       ((volatile unsigned short *)(USBSRAM_BASE+0x12))
#define USB_SZRX2       ((volatile unsigned short *)(USBSRAM_BASE+0x16))
#define USB_SZTX3       ((volatile unsigned short *)(USBSRAM_BASE+0x1A))
#define USB_SZRX3       ((volatile unsigned short *)(USBSRAM_BASE+0x1E))
#define USB_SZTX4       ((volatile unsigned short *)(USBSRAM_BASE+0x22))
#define USB_SZRX4       ((volatile unsigned short *)(USBSRAM_BASE+0x26))
#define USB_SZTX5       ((volatile unsigned short *)(USBSRAM_BASE+0x2A))
#define USB_SZRX5       ((volatile unsigned short *)(USBSRAM_BASE+0x2E))
#define USB_SZTX6       ((volatile unsigned short *)(USBSRAM_BASE+0x32))
#define USB_SZRX6       ((volatile unsigned short *)(USBSRAM_BASE+0x36))
#define USB_SZTX7       ((volatile unsigned short *)(USBSRAM_BASE+0x3A))
#define USB_SZRX7       ((volatile unsigned short *)(USBSRAM_BASE+0x3E))

