CpTrueno/LSTC_Curse/Architecture_00/Inc/SYS/STM32F042_REGS_.h
#define USBSRAM_BEGIN   (0x40)

/* *** CAN (Base: 0x.4000.6400) ****************************************** */

#define CAN_BASE        (0x40006400)
#define CAN_MCR         ((volatile unsigned int *)(CAN_BASE+0x00))
#define CAN_MSR         ((volatile unsigned int *)(CAN_BASE+0x04))
#define CAN_TSR         ((volatile unsigned int *)(CAN_BASE+0x08))
#define CAN_RF0R        ((volatile unsigned int *)(CAN_BASE+0x0C))
#define CAN_RF1R        ((volatile unsigned int *)(CAN_BASE+0x10))
#define CAN_IER         ((volatile unsigned int *)(CAN_BASE+0x14))
#define CAN_ESR         ((volatile unsigned int *)(CAN_BASE+0x18))
#define CAN_BTR         ((volatile unsigned int *)(CAN_BASE+0x1C))

#define CAN_TI0R        ((volatile unsigned int *)(CAN_BASE+0x180))
#define CAN_TDT0R       ((volatile unsigned int *)(CAN_BASE+0x184))
#define CAN_TDL0R       ((volatile unsigned int *)(CAN_BASE+0x188))
#define CAN_TDH0R       ((volatile unsigned int *)(CAN_BASE+0x18C))
#define CAN_TI1R        ((volatile unsigned int *)(CAN_BASE+0x190))
#define CAN_TDT1R       ((volatile unsigned int *)(CAN_BASE+0x194))
#define CAN_TDL1R       ((volatile unsigned int *)(CAN_BASE+0x198))
#define CAN_TDH1R       ((volatile unsigned int *)(CAN_BASE+0x19C))
#define CAN_TI2R        ((volatile unsigned int *)(CAN_BASE+0x1A0))
#define CAN_TDT2R       ((volatile unsigned int *)(CAN_BASE+0x1A4))
#define CAN_TDL2R       ((volatile unsigned int *)(CAN_BASE+0x1A8))
#define CAN_TDH2R       ((volatile unsigned int *)(CAN_BASE+0x1AC))
#define CAN_RI0R        ((volatile unsigned int *)(CAN_BASE+0x1B0))
#define CAN_RDT0R       ((volatile unsigned int *)(CAN_BASE+0x1B4))
#define CAN_RDL0R       ((volatile unsigned int *)(CAN_BASE+0x1B8))
#define CAN_RDH0R       ((volatile unsigned int *)(CAN_BASE+0x1BC))
#define CAN_RI1R        ((volatile unsigned int *)(CAN_BASE+0x1C0))
#define CAN_RDT1R       ((volatile unsigned int *)(CAN_BASE+0x1C4))
#define CAN_RDL1R       ((volatile unsigned int *)(CAN_BASE+0x1C8))
#define CAN_RDH1R       ((volatile unsigned int *)(CAN_BASE+0x1CC))

#define CAN_FMR         ((volatile unsigned int *)(CAN_BASE+0x200))
#define CAN_FM1R        ((volatile unsigned int *)(CAN_BASE+0x204))
#define CAN_FS1R        ((volatile unsigned int *)(CAN_BASE+0x20C))
#define CAN_FFA1R       ((volatile unsigned int *)(CAN_BASE+0x214))
#define CAN_FA1R        ((volatile unsigned int *)(CAN_BASE+0x21C))

#define CAN_F0R1        ((volatile unsigned int *)(CAN_BASE+0x240))
#define CAN_F0R2        ((volatile unsigned int *)(CAN_BASE+0x244))
#define CAN_F1R1        ((volatile unsigned int *)(CAN_BASE+0x248))
#define CAN_F1R2        ((volatile unsigned int *)(CAN_BASE+0x24C))
#define CAN_F2R1        ((volatile unsigned int *)(CAN_BASE+0x250))
#define CAN_F2R2        ((volatile unsigned int *)(CAN_BASE+0x254))
#define CAN_F3R1        ((volatile unsigned int *)(CAN_BASE+0x258))
#define CAN_F3R2        ((volatile unsigned int *)(CAN_BASE+0x25C))
#define CAN_F4R1        ((volatile unsigned int *)(CAN_BASE+0x260))
#define CAN_F4R2        ((volatile unsigned int *)(CAN_BASE+0x264))
#define CAN_F5R1        ((volatile unsigned int *)(CAN_BASE+0x268))
#define CAN_F5R2        ((volatile unsigned int *)(CAN_BASE+0x26C))
#define CAN_F6R1        ((volatile unsigned int *)(CAN_BASE+0x270))
#define CAN_F6R2        ((volatile unsigned int *)(CAN_BASE+0x274))
#define CAN_F7R1        ((volatile unsigned int *)(CAN_BASE+0x278))
#define CAN_F7R2        ((volatile unsigned int *)(CAN_BASE+0x27C))
#define CAN_F8R1        ((volatile unsigned int *)(CAN_BASE+0x280))
#define CAN_F8R2        ((volatile unsigned int *)(CAN_BASE+0x284))
#define CAN_F9R1        ((volatile unsigned int *)(CAN_BASE+0x288))
#define CAN_F9R2        ((volatile unsigned int *)(CAN_BASE+0x28C))
#define CAN_F10R1       ((volatile unsigned int *)(CAN_BASE+0x290))
#define CAN_F10R2       ((volatile unsigned int *)(CAN_BASE+0x294))
#define CAN_F11R1       ((volatile unsigned int *)(CAN_BASE+0x298))
#define CAN_F11R2       ((volatile unsigned int *)(CAN_BASE+0x29C))
#define CAN_F12R1       ((volatile unsigned int *)(CAN_BASE+0x2A0))
#define CAN_F12R2       ((volatile unsigned int *)(CAN_BASE+0x2A4))
#define CAN_F13R1       ((volatile unsigned int *)(CAN_BASE+0x2A8))
#define CAN_F13R2       ((volatile unsigned int *)(CAN_BASE+0x2AC))
#define CAN_F14R1       ((volatile unsigned int *)(CAN_BASE+0x2B0))
#define CAN_F14R2       ((volatile unsigned int *)(CAN_BASE+0x2B4))
#define CAN_F15R1       ((volatile unsigned int *)(CAN_BASE+0x2B8))
#define CAN_F15R2       ((volatile unsigned int *)(CAN_BASE+0x2BC))
#define CAN_F16R1       ((volatile unsigned int *)(CAN_BASE+0x2C0))
#define CAN_F16R2       ((volatile unsigned int *)(CAN_BASE+0x2C4))
#define CAN_F17R1       ((volatile unsigned int *)(CAN_BASE+0x2C8))
#define CAN_F17R2       ((volatile unsigned int *)(CAN_BASE+0x2CC))
#define CAN_F18R1       ((volatile unsigned int *)(CAN_BASE+0x2D0))
#define CAN_F18R2       ((volatile unsigned int *)(CAN_BASE+0x2D4))
#define CAN_F19R1       ((volatile unsigned int *)(CAN_BASE+0x2D8))
#define CAN_F19R2       ((volatile unsigned int *)(CAN_BASE+0x2DC))
#define CAN_F20R1       ((volatile unsigned int *)(CAN_BASE+0x2E0))
#define CAN_F20R2       ((volatile unsigned int *)(CAN_BASE+0x2E4))
#define CAN_F21R1       ((volatile unsigned int *)(CAN_BASE+0x2E8))
#define CAN_F21R2       ((volatile unsigned int *)(CAN_BASE+0x2EC))
#define CAN_F22R1       ((volatile unsigned int *)(CAN_BASE+0x2F0))
#define CAN_F22R2       ((volatile unsigned int *)(CAN_BASE+0x2F4))
#define CAN_F23R1       ((volatile unsigned int *)(CAN_BASE+0x2F8))
#define CAN_F23R2       ((volatile unsigned int *)(CAN_BASE+0x2FC))
#define CAN_F24R1       ((volatile unsigned int *)(CAN_BASE+0x300))
#define CAN_F24R2       ((volatile unsigned int *)(CAN_BASE+0x304))
#define CAN_F25R1       ((volatile unsigned int *)(CAN_BASE+0x308))
#define CAN_F25R2       ((volatile unsigned int *)(CAN_BASE+0x30C))
#define CAN_F26R1       ((volatile unsigned int *)(CAN_BASE+0x310))
#define CAN_F26R2       ((volatile unsigned int *)(CAN_BASE+0x314))
#define CAN_F27R1       ((volatile unsigned int *)(CAN_BASE+0x318))
#define CAN_F27R2       ((volatile unsigned int *)(CAN_BASE+0x31C))

/* *** CRS (Base: 0x.4000.6C00) ****************************************** */

