CpTrueno/LSTC_Curse/Architecture_00/Inc/SYS/STM32F042_REGS_.h
#define CRS_BASE        (0x40006C00)
#define CRS_CR          ((volatile unsigned int *)(CRS_BASE+0x00))
#define CRS_CFGR        ((volatile unsigned int *)(CRS_BASE+0x04))
#define CRS_ISR         ((volatile unsigned int *)(CRS_BASE+0x08))
#define CRS_ICR         ((volatile unsigned int *)(CRS_BASE+0x0C))

/* *** PWR (Base: 0x.4000.7000) ****************************************** */

#define PWR_BASE       (0x40007000)
#define PWR_CR         ((volatile unsigned int *)(PWR_BASE+0x00))
#define PWR_CSR        ((volatile unsigned int *)(PWR_BASE+0x04))

/* *** HDMI-CEC (Base: 0x.4000.7800) ************************************* */

#define CEC_BASE       (0x40007800)
#define CEC_CR         ((volatile unsigned int *)(CEC_BASE+0x00))
#define CEC_CFGR       ((volatile unsigned int *)(CEC_BASE+0x04))
#define CEC_TXDR       ((volatile unsigned int *)(CEC_BASE+0x08))
#define CEC_RXDR       ((volatile unsigned int *)(CEC_BASE+0x0C))
#define CEC_ISR         ((volatile unsigned int *)(CEC_BASE+0x10))
#define CEC_IER         ((volatile unsigned int *)(CEC_BASE+0x14))

/* ACERCA DLE MODO SLEEP (MODOS Y TRATATMIENTO) ************************** */

#define SYSCFG_BASE	(0x40010000)
#define SYSCFG_CFGR1    ((volatile unsigned int *)(SYSCFG_BASE+0x00))
#define SYSCFG_EXTICR1  ((volatile unsigned int *)(SYSCFG_BASE+0x08))
#define SYSCFG_EXTICR2  ((volatile unsigned int *)(SYSCFG_BASE+0x0C))
#define SYSCFG_EXTICR3  ((volatile unsigned int *)(SYSCFG_BASE+0x10))
#define SYSCFG_EXTICR4  ((volatile unsigned int *)(SYSCFG_BASE+0x14))
#define SYSCFG_CFGR2    ((volatile unsigned int *)(SYSCFG_BASE+0x18))

/* *** EXTI (0x.4000.0400) ************************************************ */

#define EXTI_BASE       (0x40010400)
#define EXTI_IMR        ((volatile unsigned int *)(EXTI_BASE+0x00))
#define EXTI_EMR        ((volatile unsigned int *)(EXTI_BASE+0x04))
#define EXTI_RTSR       ((volatile unsigned int *)(EXTI_BASE+0x08))
#define EXTI_FTSR       ((volatile unsigned int *)(EXTI_BASE+0x0C))
#define EXTI_SWIER      ((volatile unsigned int *)(EXTI_BASE+0x10))
#define EXTI_PR         ((volatile unsigned int *)(EXTI_BASE+0x14))

/* *** ADC (base 0x.4001.2400) ******************************************* */

#define ADC_BASE        (0x40012400)
#define ADC_ISR         ((volatile unsigned int *)(ADC_BASE+0x00))
#define ADC_IER         ((volatile unsigned int *)(ADC_BASE+0x04))
#define ADC_CR          ((volatile unsigned int *)(ADC_BASE+0x08))
#define ADC_CFGR1       ((volatile unsigned int *)(ADC_BASE+0x0C))
#define ADC_CFGR2       ((volatile unsigned int *)(ADC_BASE+0x10))
#define ADC_SMPR        ((volatile unsigned int *)(ADC_BASE+0x14))
#define ADC_TR          ((volatile unsigned int *)(ADC_BASE+0x20))
#define ADC_CHSELR      ((volatile unsigned int *)(ADC_BASE+0x28))
#define ADC_DR          ((volatile unsigned int *)(ADC_BASE+0x40))
#define ADC_CCR         ((volatile unsigned int *)(ADC_BASE+0x308))

/* **** TIM1 (Base:0x.4001.2C00) ***************************************** */

#define TIM1_BASE        (0x40012C00)
#define TIM1_CR1        ((volatile unsigned int *)(TIM1_BASE+0x00))
#define TIM1_CR2        ((volatile unsigned int *)(TIM1_BASE+0x04))
#define TIM1_SMCR       ((volatile unsigned int *)(TIM1_BASE+0x08))
#define TIM1_DIER       ((volatile unsigned int *)(TIM1_BASE+0x0C))
#define TIM1_SR         ((volatile unsigned int *)(TIM1_BASE+0x10))
#define TIM1_EGR        ((volatile unsigned int *)(TIM1_BASE+0x14))
#define TIM1_CCMR1      ((volatile unsigned int *)(TIM1_BASE+0x18))
#define TIM1_CCMR2      ((volatile unsigned int *)(TIM1_BASE+0x1C))
#define TIM1_CCER       ((volatile unsigned int *)(TIM1_BASE+0x20))
#define TIM1_CNT        ((volatile unsigned int *)(TIM1_BASE+0x24))
#define TIM1_PSC        ((volatile unsigned int *)(TIM1_BASE+0x28))
#define TIM1_ARR        ((volatile unsigned int *)(TIM1_BASE+0x2C))
#define TIM1_RCR        ((volatile unsigned int *)(TIM1_BASE+0x30))
#define TIM1_CCR1       ((volatile unsigned int *)(TIM1_BASE+0x34))
#define TIM1_CCR2       ((volatile unsigned int *)(TIM1_BASE+0x38))
#define TIM1_CCR3       ((volatile unsigned int *)(TIM1_BASE+0x3C))
#define TIM1_CCR4       ((volatile unsigned int *)(TIM1_BASE+0x40))
#define TIM1_BDTR       ((volatile unsigned int *)(TIM1_BASE+0x44))
#define TIM1_DCR        ((volatile unsigned int *)(TIM1_BASE+0x48))
#define TIM1_DMAR       ((volatile unsigned int *)(TIM1_BASE+0x4C))

/* *** SPI1/I2S1 (Base: 0x.4001.3000) ************************************ */

#define SPI1_BASE       (0x40013000)
#define SPI1_CR1        ((volatile unsigned int *)(SPI1_BASE+0x00))
#define SPI1_CR2        ((volatile unsigned int *)(SPI1_BASE+0x04))
#define SPI1_SR         ((volatile unsigned int *)(SPI1_BASE+0x08))
#define SPI1_DR         ((volatile unsigned int *)(SPI1_BASE+0x0C))
#define SPI1_CRCPR      ((volatile unsigned int *)(SPI1_BASE+0x10))
#define SPI1_RXCRCR     ((volatile unsigned int *)(SPI1_BASE+0x14))
#define SPI1_TXCRCR     ((volatile unsigned int *)(SPI1_BASE+0x18))
#define SPI1_I2SCFGR    ((volatile unsigned int *)(SPI1_BASE+0x1C))
#define SPI1_I2SPR      ((volatile unsigned int *)(SPI1_BASE+0x20))

/* *** USART1 (Base: 0x.4001.3800) *************************************** */

#define USART1_BASE       (0x40013800)
#define USART1_CR1        ((volatile unsigned int *)(USART1_BASE+0x00))
#define USART1_CR2        ((volatile unsigned int *)(USART1_BASE+0x04))
#define USART1_CR3        ((volatile unsigned int *)(USART1_BASE+0x08))
#define USART1_BRR        ((volatile unsigned int *)(USART1_BASE+0x0C))
#define USART1_GTPR       ((volatile unsigned int *)(USART1_BASE+0x10))
#define USART1_RTOR       ((volatile unsigned int *)(USART1_BASE+0x14))
#define USART1_RQR        ((volatile unsigned int *)(USART1_BASE+0x18))
#define USART1_ISR        ((volatile unsigned int *)(USART1_BASE+0x1C))
#define USART1_ICR        ((volatile unsigned int *)(USART1_BASE+0x20))
#define USART1_RDR        ((volatile unsigned int *)(USART1_BASE+0x24))
#define USART1_TDR        ((volatile unsigned int *)(USART1_BASE+0x28))

