CpTrueno/LSTC_Curse/Architecture_00/Inc/SYS/STM32F042_REGS_.h
/* *** TIM16 (Base: 0x.4001.4400) **************************************** */

#define TIM16_BASE        (0x40014400)
#define TIM16_CR1         ((volatile unsigned int *)(TIM16_BASE+0x00))
#define TIM16_CR2         ((volatile unsigned int *)(TIM16_BASE+0x04))
#define TIM16_DIER        ((volatile unsigned int *)(TIM16_BASE+0x0C))
#define TIM16_SR          ((volatile unsigned int *)(TIM16_BASE+0x10))
#define TIM16_EGR         ((volatile unsigned int *)(TIM16_BASE+0x14))
#define TIM16_CCMR1       ((volatile unsigned int *)(TIM16_BASE+0x18))
#define TIM16_CCER        ((volatile unsigned int *)(TIM16_BASE+0x20))
#define TIM16_CNT         ((volatile unsigned int *)(TIM16_BASE+0x24))
#define TIM16_PSC         ((volatile unsigned int *)(TIM16_BASE+0x28))
#define TIM16_ARR         ((volatile unsigned int *)(TIM16_BASE+0x2C))
#define TIM16_RCR         ((volatile unsigned int *)(TIM16_BASE+0x30))
#define TIM16_CCR1        ((volatile unsigned int *)(TIM16_BASE+0x34))
#define TIM16_BDTR        ((volatile unsigned int *)(TIM16_BASE+0x44))
#define TIM16_DCR         ((volatile unsigned int *)(TIM16_BASE+0x48))
#define TIM16_DMAR        ((volatile unsigned int *)(TIM16_BASE+0x4C))

/* *** TIM17 (Base: 0x.4001.4800) **************************************** */

#define TIM17_BASE        (0x40014800)
#define TIM17_CR1         ((volatile unsigned int *)(TIM17_BASE+0x00))
#define TIM17_CR2         ((volatile unsigned int *)(TIM17_BASE+0x04))
#define TIM17_DIER        ((volatile unsigned int *)(TIM17_BASE+0x0C))
#define TIM17_SR          ((volatile unsigned int *)(TIM17_BASE+0x10))
#define TIM17_EGR         ((volatile unsigned int *)(TIM17_BASE+0x14))
#define TIM17_CCMR1       ((volatile unsigned int *)(TIM17_BASE+0x18))
#define TIM17_CCER        ((volatile unsigned int *)(TIM17_BASE+0x20))
#define TIM17_CNT         ((volatile unsigned int *)(TIM17_BASE+0x24))
#define TIM17_PSC         ((volatile unsigned int *)(TIM17_BASE+0x28))
#define TIM17_ARR         ((volatile unsigned int *)(TIM17_BASE+0x2C))
#define TIM17_RCR         ((volatile unsigned int *)(TIM17_BASE+0x30))
#define TIM17_CCR1        ((volatile unsigned int *)(TIM17_BASE+0x34))
#define TIM17_BDTR        ((volatile unsigned int *)(TIM17_BASE+0x44))
#define TIM17_DCR         ((volatile unsigned int *)(TIM17_BASE+0x48))
#define TIM17_DMAR        ((volatile unsigned int *)(TIM17_BASE+0x4C))

/* *** DBGMCU (Base: 0x.4001.5800) *************************************** */

#define DBGMCU_BASE        (0x40015800)
#define DBGMCU_IDCODE      ((volatile unsigned int *)(DBGMCU_BASE+0x00))
#define DBGMCU_CR          ((volatile unsigned int *)(DBGMCU_BASE+0x04))
#define DBGMCU_APB1_FZ     ((volatile unsigned int *)(DBGMCU_BASE+0x08))
#define DBGMCU_APB2_FZ     ((volatile unsigned int *)(DBGMCU_BASE+0x0C))

/* **************************************************************************
** PERIPHERALS TO AHB1
************************************************************************** */

/* *** DMA1 (Base: 0x.4002.0000) ***************************************** */

#define DMA_BASE        (0x40020000)

#define DMA_ISR        ((volatile uint32_t *)(DMA_BASE+0x00))
#define DMA_IFCR       ((volatile uint32_t *)(DMA_BASE+0x04))

#define DMA_CCR1       ((volatile uint32_t *)(DMA_BASE+0x08))
#define DMA_CNDTR1     ((volatile uint32_t *)(DMA_BASE+0x0C))
#define DMA_CPAR1      ((volatile uint32_t *)(DMA_BASE+0x10))
#define DMA_CMAR1      ((volatile uint32_t *)(DMA_BASE+0x14))
#define DMA_CCR2       ((volatile uint32_t *)(DMA_BASE+0x1C))
#define DMA_CNDTR2     ((volatile uint32_t *)(DMA_BASE+0x20))
#define DMA_CPAR2      ((volatile uint32_t *)(DMA_BASE+0x24))
#define DMA_CMAR2      ((volatile uint32_t *)(DMA_BASE+0x28))
#define DMA_CCR3       ((volatile uint32_t *)(DMA_BASE+0x30))
#define DMA_CNDTR3     ((volatile uint32_t *)(DMA_BASE+0x34))
#define DMA_CPAR3      ((volatile uint32_t *)(DMA_BASE+0x38))
#define DMA_CMAR3      ((volatile uint32_t *)(DMA_BASE+0x3C))
#define DMA_CCR4       ((volatile uint32_t *)(DMA_BASE+0x44))
#define DMA_CNDTR4     ((volatile uint32_t *)(DMA_BASE+0x48))
#define DMA_CPAR4      ((volatile uint32_t *)(DMA_BASE+0x4C))
#define DMA_CMAR4      ((volatile uint32_t *)(DMA_BASE+0x50))
#define DMA_CCR5       ((volatile uint32_t *)(DMA_BASE+0x58))
#define DMA_CNDTR5     ((volatile uint32_t *)(DMA_BASE+0x5C))
#define DMA_CPAR5      ((volatile uint32_t *)(DMA_BASE+0x60))
#define DMA_CMAR5      ((volatile uint32_t *)(DMA_BASE+0x64))
#define DMA_CCR6       ((volatile uint32_t *)(DMA_BASE+0x6C))
#define DMA_CNDTR6     ((volatile uint32_t *)(DMA_BASE+0x70))
#define DMA_CPAR6      ((volatile uint32_t *)(DMA_BASE+0x74))
#define DMA_CMAR6      ((volatile uint32_t *)(DMA_BASE+0x78))
#define DMA_CCR7       ((volatile uint32_t *)(DMA_BASE+0x80))
#define DMA_CNDTR7     ((volatile uint32_t *)(DMA_BASE+0x84))
#define DMA_CPAR7      ((volatile uint32_t *)(DMA_BASE+0x88))
#define DMA_CMAR7      ((volatile uint32_t *)(DMA_BASE+0x8C))

#define DMA_CSELR     ((volatile uint32_t *)(DMA_BASE+0xA8))


/* *** RCC RESET & POWER CONTROL (Base: 0x.4002.3800) ******************** */

#define RCC_BASE        (0x40021000)
#define RCC_CR          ((volatile unsigned int *)(RCC_BASE+0x00))
#define RCC_CFGR        ((volatile unsigned int *)(RCC_BASE+0x04))
#define RCC_CIR         ((volatile unsigned int *)(RCC_BASE+0x08))
#define RCC_APB2RSTR    ((volatile unsigned int *)(RCC_BASE+0x0C))
#define RCC_APB1RSTR    ((volatile unsigned int *)(RCC_BASE+0x10))
#define RCC_AHBENR      ((volatile unsigned int *)(RCC_BASE+0x14))
#define RCC_APB2ENR     ((volatile unsigned int *)(RCC_BASE+0x18))
#define RCC_APB1ENR     ((volatile unsigned int *)(RCC_BASE+0x1C))
#define RCC_BDCR        ((volatile unsigned int *)(RCC_BASE+0x20))
#define RCC_CSR         ((volatile unsigned int *)(RCC_BASE+0x24))
#define RCC_AHBRSTR     ((volatile unsigned int *)(RCC_BASE+0x28))
#define RCC_CFGR2       ((volatile unsigned int *)(RCC_BASE+0x2C))
#define RCC_CFGR3       ((volatile unsigned int *)(RCC_BASE+0x30))
#define RCC_CR2         ((volatile unsigned int *)(RCC_BASE+0x34))

/* *** FLASH INTERFACE (Base 0x.4002.2000) ******************************* */

