CpTrueno/LSTC_Curse/Architecture_00/Inc/SYS/STM32F042_REGS_.h
#define FLASH_BASE      (0x40022000)
#define FLASH_ACR       ((volatile unsigned int *)(FLASH_BASE+0x00))
#define FLASH_KEYR      ((volatile unsigned int *)(FLASH_BASE+0x04))
#define FLASH_OPTKEYR   ((volatile unsigned int *)(FLASH_BASE+0x08))
#define FLASH_SR        ((volatile unsigned int *)(FLASH_BASE+0x0C))
#define FLASH_CR        ((volatile unsigned int *)(FLASH_BASE+0x10))
#define FLASH_AR        ((volatile unsigned int *)(FLASH_BASE+0x14))
#define FLASH_OBR       ((volatile unsigned int *)(FLASH_BASE+0x1C))
#define FLASH_WRPR      ((volatile unsigned int *)(FLASH_BASE+0x20))

/* *** CRC (Base: 0x.4002.3000) ****************************************** */

#define CRC_BASE        (0x40023000)
#define CRC_DR          ((volatile unsigned int *)(CRC_BASE+0x00))
#define CRC_IDR         ((volatile unsigned int *)(CRC_BASE+0x04))
#define CRC_CR          ((volatile unsigned int *)(CRC_BASE+0x08))
#define CRC_INIT        ((volatile unsigned int *)(CRC_BASE+0x0C))
#define CRC_POL         ((volatile unsigned int *)(CRC_BASE+0x10))

/* *** TSC (Base: 0x.4002.4000) ****************************************** */

#define TSC_BASE        (0x40024000)
#define TSC_CR          ((volatile unsigned int *)(TSC_BASE+0x00))
#define TSC_IER         ((volatile unsigned int *)(TSC_BASE+0x04))
#define TSC_ICR         ((volatile unsigned int *)(TSC_BASE+0x08))
#define TSC_ISR         ((volatile unsigned int *)(TSC_BASE+0x0C))
#define TSC_IOHCR       ((volatile unsigned int *)(TSC_BASE+0x10))
#define TSC_IOASCR      ((volatile unsigned int *)(TSC_BASE+0x18))
#define TSC_IOSCR       ((volatile unsigned int *)(TSC_BASE+0x20))
#define TSC_IOCCR       ((volatile unsigned int *)(TSC_BASE+0x28))
#define TSC_IOGCSR      ((volatile unsigned int *)(TSC_BASE+0x30))
#define TSC_IOG1CR      ((volatile unsigned int *)(TSC_BASE+0x34))
#define TSC_IOG2CR      ((volatile unsigned int *)(TSC_BASE+0x38))
#define TSC_IOG3CR      ((volatile unsigned int *)(TSC_BASE+0x3C))
#define TSC_IOG4CR      ((volatile unsigned int *)(TSC_BASE+0x40))
#define TSC_IOG5CR      ((volatile unsigned int *)(TSC_BASE+0x44))
#define TSC_IOG6CR      ((volatile unsigned int *)(TSC_BASE+0x48))
#define TSC_IOG7CR      ((volatile unsigned int *)(TSC_BASE+0x4C))
#define TSC_IOG8CR      ((volatile unsigned int *)(TSC_BASE+0x50))

/* **************************************************************************
** PERIPHERALS TO AHB2
************************************************************************** */

/* *** GPIO PortA (Base: 0x.4002.0000) *********************************** */

#define GPIOA_BASE      (0x48000000)
#define GPIOA_MODER     ((volatile unsigned int *)(GPIOA_BASE+0x00))
#define GPIOA_OTYPER    ((volatile unsigned int *)(GPIOA_BASE+0x04))
#define GPIOA_OSPEEDR   ((volatile unsigned int *)(GPIOA_BASE+0x08))
#define GPIOA_PUPDR     ((volatile unsigned int *)(GPIOA_BASE+0x0C))
#define GPIOA_IDR       ((volatile unsigned int *)(GPIOA_BASE+0x10))
#define GPIOA_ODR       ((volatile unsigned int *)(GPIOA_BASE+0x14))
#define GPIOA_BSRR      ((volatile unsigned int *)(GPIOA_BASE+0x18))
#define GPIOA_LCKR      ((volatile unsigned int *)(GPIOA_BASE+0x1C))
#define GPIOA_AFRL      ((volatile unsigned int *)(GPIOA_BASE+0x20))
#define GPIOA_AFRH      ((volatile unsigned int *)(GPIOA_BASE+0x24))
#define GPIOA_BRR       ((volatile unsigned int *)(GPIOA_BASE+0x28))

/* *** GPIO PortB (Base: 0x.4002.0400) *********************************** */

#define GPIOB_BASE      0x48000400
#define GPIOB_MODER     ((volatile unsigned int *)(GPIOB_BASE+0x00))
#define GPIOB_OTYPER    ((volatile unsigned int *)(GPIOB_BASE+0x04))
#define GPIOB_OSPEEDR   ((volatile unsigned int *)(GPIOB_BASE+0x08))
#define GPIOB_PUPDR     ((volatile unsigned int *)(GPIOB_BASE+0x0C))
#define GPIOB_IDR       ((volatile unsigned int *)(GPIOB_BASE+0x10))
#define GPIOB_ODR       ((volatile unsigned int *)(GPIOB_BASE+0x14))
#define GPIOB_BSRR      ((volatile unsigned int *)(GPIOB_BASE+0x18))
#define GPIOB_LCKR      ((volatile unsigned int *)(GPIOB_BASE+0x1C))
#define GPIOB_AFRL      ((volatile unsigned int *)(GPIOB_BASE+0x20))
#define GPIOB_AFRH      ((volatile unsigned int *)(GPIOB_BASE+0x24))
#define GPIOB_BRR       ((volatile unsigned int *)(GPIOB_BASE+0x28))

/* *** GPIO PortC (Base: 0x.4002.0800) *********************************** */

#define GPIOC_BASE      0x48000800
#define GPIOC_MODER     ((volatile unsigned int *)(GPIOC_BASE+0x00))
#define GPIOC_OTYPER    ((volatile unsigned int *)(GPIOC_BASE+0x04))
#define GPIOC_OSPEEDR   ((volatile unsigned int *)(GPIOC_BASE+0x08))
#define GPIOC_PUPDR     ((volatile unsigned int *)(GPIOC_BASE+0x0C))
#define GPIOC_IDR       ((volatile unsigned int *)(GPIOC_BASE+0x10))
#define GPIOC_ODR       ((volatile unsigned int *)(GPIOC_BASE+0x14))
#define GPIOC_BSRR      ((volatile unsigned int *)(GPIOC_BASE+0x18))
#define GPIOC_LCKR      ((volatile unsigned int *)(GPIOC_BASE+0x1C))
#define GPIOC_AFRL      ((volatile unsigned int *)(GPIOC_BASE+0x20))
#define GPIOC_AFRH      ((volatile unsigned int *)(GPIOC_BASE+0x24))
#define GPIOC_BRR       ((volatile unsigned int *)(GPIOC_BASE+0x28))

/* *** GPIO PortF (Base: 0x.4002.1400) *********************************** */

#define GPIOF_BASE      0x48001400
#define GPIOF_MODER     ((volatile unsigned int *)(GPIOF_BASE+0x00))
#define GPIOF_OTYPER    ((volatile unsigned int *)(GPIOF_BASE+0x04))
#define GPIOF_OSPEEDR   ((volatile unsigned int *)(GPIOF_BASE+0x08))
#define GPIOF_PUPDR     ((volatile unsigned int *)(GPIOF_BASE+0x0C))
#define GPIOF_IDR       ((volatile unsigned int *)(GPIOF_BASE+0x10))
#define GPIOF_ODR       ((volatile unsigned int *)(GPIOF_BASE+0x14))
#define GPIOF_BSRR      ((volatile unsigned int *)(GPIOF_BASE+0x18))
#define GPIOF_LCKR      ((volatile unsigned int *)(GPIOF_BASE+0x1C))
#define GPIOF_AFRL      ((volatile unsigned int *)(GPIOF_BASE+0x20))
#define GPIOF_AFRH      ((volatile unsigned int *)(GPIOF_BASE+0x24))
#define GPIOF_BRR       ((volatile unsigned int *)(GPIOF_BASE+0x28))

/* **************************************************************************
** OTHER INTERNAL & CALIBRATION VALUES
************************************************************************** */

/* *** TEMPERATURE CALIBRATION VALUES ************************************ */

#define TS_CAL1         ((volatile unsigned short int *)(0x1FFFF7B8))
#define TS_CAL2         ((volatile unsigned short int *)(0x1FFFF7C2))

/* *** INTERNAL VOLTAGE REFERENCE CALIBRATION VALUE ********************** */

#define VREFINT_CAL     ((volatile unsigned short int *)(0x1FFFF7BA))


/* **************************************************************************
** END OF DEFINITIONS
************************************************************************** */




#endif /* STM32F042_REGS__H_ */
